#!/usr/bin/python
# -*- coding: UTF-8 -*-
# --------------------------------------------------------- #
#                    SL SOFTWARE GROUP                      #
# --------------------------------------------------------- #
# @Author       :    AresHe
# @Mail         :    502614708@qq.com
# @DateTime     :    2023/4/22 11:08
# @Revision     :    1.0.0
# @File         :    __init__.py.py
# @Software     :    PyCharm
# @Usefor       :
# --------------------------------------------------------- #

_header = {
    'description': '''
    -> 本程序任何其他团体或个人如需使用，必须经作者的批准，并遵守以下约定；
    1> 本着尊重创作者的劳动成果，任何团体或个人在使用此程序的时候，均需要知会此程序的原始创作者；
    2> 在任何场合宣导、宣传，在任何文件、报告、邮件中提及本程序的全部或部分功能，均需要声明此程序的
       原始创作者；
    3> 在任何时候对本程序做部分修改或者是升级时，必须要保留文件的原始信息，包括原始文件名、创作者及
       联系方式、创作日期等信息，且不得删除程序中的源代码，只能进行注释处理；
'''
}
'''
                   _ooOoo_
                  o8888888o
                  88" . "88
                  (| -_- |)
                  O\  =  /O
               ____/`---'\____
             .'  \\|     |//  `.
            /  \\|||  :  |||//  \
           /  _||||| -:- |||||-  \
           |   | \\\  -  /// |   |
           | \_|  ''\---/''  |   |
           \  .-\__  `-`  ___/-. /
         ___`. .'  /--.--\  `. . __
      ."" '<  `.___\_<|>_/___.'  >'"".
     | | :  `- \`.;`\ _ /`;.`/ - ` : | |
     \  \ `-.   \_ __\ /__ _/   .-` /  /
======`-.____`-.___\_____/___.-`____.-'======
                   `=---='
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
           佛祖保佑       永无BUG
'''
import os
import sys

if __name__ == "__main__":
    pass
